In [18]:
import pandas as pd
from pathlib import Path

In [19]:
chorus_classnames = [
    "artist", "address", "city", "director", "album", "currency", "product", "isbn", "manufacturer", "birthDate",
]

In [20]:
target_files = [
    "/home/bf996/archetype/data/VizNet/sato_cv_0.csv",
    "/home/bf996/archetype/data/VizNet/sato_cv_1.csv",
    "/home/bf996/archetype/data/VizNet/sato_cv_2.csv",
    "/home/bf996/archetype/data/VizNet/sato_cv_3.csv",
    "/home/bf996/archetype/data/VizNet/sato_cv_4.csv",
]

In [21]:
dfs = pd.concat([pd.read_csv(x) for x in target_files])

In [22]:
len(dfs)

119360

In [23]:
print(len(pd.unique(dfs['class'])))

78

In [24]:
print(pd.unique(dfs['class']))

['name' 'rank' 'city' 'year' 'status' 'age' 'club' 'class' 'team' 'result'
 'company' 'symbol' 'artist' 'location' 'notes' 'weight' 'type' 'day'
 'state' 'description' 'address' 'category' 'position' 'person' 'code'
 'plays' 'gender' 'service' 'album' 'duration' 'format' 'area' 'range'
 'elevation' 'currency' 'credit' 'depth' 'fileSize' 'component' 'country'
 'county' 'industry' 'product' 'teamName' 'birthDate' 'sex' 'jockey'
 'owner' 'publisher' 'language' 'nationality' 'affiliation' 'origin'
 'creator' 'order' 'affiliate' 'collection' 'family' 'capacity'
 'classification' 'grades' 'birthPlace' 'requirement' 'species' 'ranking'
 'region' 'isbn' 'genre' 'brand' 'religion' 'manufacturer' 'continent'
 'command' 'sales' 'operator' 'education' 'director' 'organisation']

In [25]:
dfs.sample(10)

,table_id,col_idx,class,class_id,data
14494,webtables2/K4/0_1438042987171.38;warc;CC-MAIN-...,1,city,12,Memphis (HQ) Nashville Memphis (HQ)
6725,webtables1/K4/0_1438042986022.41;warc;CC-MAIN-...,0,club,15,Houston Dynamo Houston Dynamo
3113,webtables1/K1/0_1438042986022.41;warc;CC-MAIN-...,0,status,71,canceled/ended (2008-2009 season) canceled/end...
5719,webtables1/K2/0_1438042986022.41;warc;CC-MAIN-...,0,team,73,EAST WBS
11462,webtables1/K4/0_1438042986022.41;warc;CC-MAIN-...,0,team,73,Broncos Cowboys Roosters Rabbitohs Storm Shark...
10583,webtables1/K2/0_1438042986022.41;warc;CC-MAIN-...,0,description,29,Show only sites with or without reviews. Only ...
23653,webtables2/K3/0_1438042987171.38;warc;CC-MAIN-...,0,team,73,18. MK Dons 19. Preston 20. Q.P.R. 21. Reading...
15204,webtables2/K4/0_1438042987171.38;warc;CC-MAIN-...,1,category,11,PER PER TS% eFG% eFG% eFG% EFF EFF/40 WS/40 Pt...
21877,webtables2/K4/0_1438042987171.38;warc;CC-MAIN-...,0,team,73,Alabama Oregon Florida State Ohio State Baylor...
14364,webtables2/K2/0_1438042987171.38;warc;CC-MAIN-...,1,description,29,NADPL…PPLKG → SHWNWRTRLLGWV in isoform 3. 1 Pu...

In [26]:
dfss = dfs[dfs['class'].isin(chorus_classnames)]
len(dfss)

10739

In [27]:
#NOTE: fails when replace is false

In [29]:
for c in chorus_classnames:
    print(c)
    print(len(pd.unique(dfss[dfss['class'] == c]['data'])))

artist
1930
address
836
city
5004
director
33
album
1375
currency
33
product
330
isbn
228
manufacturer
122
birthDate
64

In [31]:
chorus_small_classnames = [
    "director", "currency", "birthDate",
]

chorus_large_classnames = [
    "artist", "address", "city", "album", "product", "isbn", "manufacturer",
]

In [37]:
dftest = pd.concat([
    dfs[dfs['class'].isin(chorus_small_classnames)].groupby('class', group_keys=False).apply(lambda x: x.sample(33, replace=False)),
    dfs[dfs['class'].isin(chorus_small_classnames)].groupby('class', group_keys=False).apply(lambda x: x.sample(67, replace=True)),
    dfs[dfs['class'].isin(chorus_large_classnames)].groupby('class', group_keys=False).apply(lambda x: x.sample(100, replace=False)),
])

In [38]:
len(dftest)

1000

In [39]:
for c in chorus_classnames:
    print(c)
    print(len(pd.unique(dftest[dftest['class'] == c]['data'])))

artist
99
address
100
city
100
director
33
album
99
currency
26
product
95
isbn
100
manufacturer
86
birthDate
54

In [41]:
dftest.to_csv("/home/bf996/archetype/data/VizNet/VizNet_chorus_test.csv", index=False)